package java8to21.java9;
/*
Java 21: LTS з новими стандартами
Virtual Threads (виртуальні потоки): Нарешті, виведені зі статусу попереднього випробування, дозволяють створювати тисячі легковагих потоків для обробки конкурентних задач.
Record Patterns та Pattern Matching для switch: Повна підтримка шаблонів для більш складного pattern matching.
String Templates: Дозволяють створювати стрічки зі змінними з більшою безпекою та зручністю.
Покращення Foreign Function & Memory API: Повноцінний API для взаємодії з нативною пам'яттю та сторонніми бібліотеками.
*/
public class JavaChanges21LTS {
}
